// Chapter02 C++ 함수와 네임스페이스

// 2.5 식별자 검색 순서

/**
 * 전역 함수인 경우
 *
 * 1. 현재 블록 범위
 * 2. 현재 블록 범위를 포함하고 있는 상위 블록 범위(최대 적용 범위는 함수 몸체까지)
 * 3. 가장 최근에 선언된 전역 변수나 함수
 * 4. using 선언된 네임스페이스 혹은 전역 네임스페이스. 단, 두 곳에 동일한 식별자가 존재할 경우 컴파일 오류 발생!
 */

/**
 * 클래스 메서드인 경우
 *
 * 1. 현재 블록 범위
 * 2. 현재 블록 범위를 포함하고 있는 상위 블록 범위(최대 적용 범위는 함수 몸체까지)
 * 3. 클래스의 멤버
 * 4. 부모 클래스의 멤버
 * 5. 가장 최근에 선언된 전역 변수나 함수
 * 6. 호출자 코드가 속한 네임스페이스의 상위 네임스페이스
 * 7. using 선언된 네임스페이스 혹은 전역 네임스페이스. 단, 두 곳에 동일한 식별자가 존재할 경우 컴파일 오류 발생!
 */

// 2.5.1 현재 블록 범위

#include <iostream>

using namespace std;

int nData{20};

int main(int argc, char *argv[]) {
    int nData{10};  // 1. 식별자에 접근하는 코드가 속한 현재 블록 범위({} 구간)

    cout << nData << endl;
    cout << argc << endl;

    return 0;
}